# ExistingSegmentCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..ExistingSegmentCurves Property
CurtainGridLine Class See Also
---
Retrieve all the existing segment curves of the grid line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray ExistingSegmentCurves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExistingSegmentCurves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ ExistingSegmentCurves {
	CurveArray^ get ();
}
```

# Remarks
User can get these curves and call RemoveSegment() to remove the segments to the gridline or call AddMullions() to add mullions to these segments.
# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace